export const ieq = [
  {
    id: 1,
    text: "심심한데 프로젝트나 해볼까...?\n 당신이 선호하는 프로젝트는?",
    choices: ["혼자서 진행하는\n 개인 프로젝트", "팀 프로젝트"],
  },
  {
    id: 1,
    text: "다음 강의 시작까지 30분이 남았다",
    choices: [
      "강의실에 미리 가서 앉아있거나\n 편의점에서 혼밥하고 들어가기",
      "과방이나 동방에서\n 사람들이랑 시간 때우기",
    ],
  },
  {
    id: 1,
    text: "연합동아리 정기모임에 처음 참석한 날.\n 나만 빼고 다들 친해보인다면?",
    choices: [
      "아는 사람이 아무도 없네...\n 중요 공지만 숙지하고 바로 귀가",
      "아는 사람이 아무도 없잖아?!\n 바로 옆사람에게 말걸고 회식까지 고고씽~!",
    ],
  },
  {
    id: 1,
    text: "다음 두 가지 행사 중 하나를 고른다면 당신의 선택은?",
    choices: [
      "집에서 혼자 조금씩 진행하는 공모전",
      "처음 보는 사람들과 하루종일 함께하는 해커톤",
    ],
  },
  {
    id: 1,
    text: "팀 프로젝트를 하게 되었을 때, 선호하는 회의 방식은?",
    choices: ["무조건 비대면!!", "대면으로 회의하고 밥이라도 같이 먹어야지!!"],
  },
];
export const nsq = [
  {
    id: 2,
    text: "프로젝트에서 내가 맡고 싶은 역할은?",
    choices: [
      "참신한 아이디어로 프로젝트에 독창성을 불어넣는 기획자",
      "깔끔하게 자료정리하는 역할",
    ],
  },
  {
    id: 2,
    text: "알고리즘 문제를 푸는데 오늘따라 문제가 쉽게 느껴진다면, 당신의 머릿속에 떠오르는 생각은?",
    choices: [
      "내카라쿠배 중 어느 기업에 입사하면 좋을지 고민하며 멋진 개발자가 된 내 모습을 상상해본다",
      "이정도면 됐어. 다른 유형 알고리즘을 공부해볼까?",
    ],
  },
  {
    id: 2,
    text: "백엔드와 프론트엔드 중 한 분야의 진로를 골라보라고 한다면",
    choices: [
      "경험자들에게 조언을 구해보고 둘 중에 하나를 골라보기로 한다",
      "백엔드? 프론트엔드? 일단 둘 다 한번씩 경험해보기로 한다",
    ],
  },
  {
    id: 2,
    text: "N/S 질문 내용1",
    choices: ["응답 (N)", "응답 (S)"],
  },
];

export const tfq = [
  {
    id: 3,
    text: "친구가 '30초 지각했는데 교수님이 지각처리하셨어..' 라고 푸념한다면, 당신의 응답은?",
    choices: [
      "출결 점수 비율 몇이나 되는데? 교수님한테 한번만 봐달라고 해봤어?? 집에서 조금만 일찍 나오지..",
      "헐.. 너무하시다 그정돈 봐줄 수 있는 거 아냐?? 그 교수님 그렇게 안 봤는데 어쩌구저쩌구..",
    ],
  },
  {
    id: 3,
    text: "T/F 질문 내용1",
    choices: ["응답 (T)", "응답 (F)"],
  },
  {
    id: 3,
    text: "T/F 질문 내용2",
    choices: ["응답 (T)", "응답 (F)"],
  },
  {
    id: 3,
    text: "T/F 질문 내용3",
    choices: ["응답 (T)", "응답 (F)"],
  },
];

export const pjq = [
  {
    id: 4,
    text: "시험이 1주일 남은 시점. 나의 상태는?",
    choices: [
      "엥 벌써 1주일밖에 안 남았어?",
      "후 1주일 남았군.. 오늘 하기로 했던 공부는...(플래너를 확인하며)",
    ],
  },
  {
    id: 4,
    text: "과제가 잔뜩 밀려있다. 어떻게 할까?",
    choices: [
      "더 재미있어 보이거나 쉬워보이는 것부터 일단 시작한다",
      "남은 과제를 쭉 보고 중요도와 난이도를 고려해 순서 우선순위를 짠다",
    ],
  },
  {
    id: 4,
    text: "일주일 내로 제출해야 하는 중요한 과제. 이틀 안에 끝낼 수 있을 것 같다면?",
    choices: [
      "이틀이면 되겠네? 닷새는 더 놀아야지~",
      "이틀이면 되겠네? 얼른 끝내버리고 편하게 놀자",
    ],
  },
  {
    id: 4,
    text: "코딩에 열중하고 있는 당신의 책상 상태는?",
    choices: [
      "남들이 보기엔 너저분해보일 수 있지만 어디에 뭐가 있는지 나는 전부 알고있는 책상",
      "눈이 편해야 작업하기도 편한 법! 무조건 깔끔하게 정돈된 책상",
    ],
  },
  {
    id: 4,
    text: "반응형 웹페이지를 만든다고 했을 때",
    choices: [
      "이정도 폭이면 모바일에서도 얼추 맞겠지?",
      "어디보자.. 모바일 환경이면 폭이 ~~~px정도니까...",
    ],
  },
];
